app/controllers/seller/products_controller.rb

SELECT * FROM `products` WHERE (title LIKE '%products%')
---
  def search
    @products = { }
    @offer = Offer.new
    if !params[:product].nil?
      logger.info("[PRODUCT]Search text =>" + params[:product])
      @products = Product.find(:all, :conditions => ['title LIKE ?',"%#{params[:product]}%"])