app/controllers/seller/products_controller.rb

SELECT * FROM `users` WHERE (`users`.`id` = 1) LIMIT 1
SELECT `offers`.* FROM `offers` INNER JOIN `user_product_offers` ON `offers`.id = `user_product_offers`.offer_id WHERE ((`user_product_offers`.user_id = 1))
SELECT `products`.* FROM `products` INNER JOIN `offers` ON `products`.id = `offers`.product_id WHERE ((`offers`.user_id = 1))
---
  def index

    @user = User.find(current_user.id)
    logger.info("user id " + @user.id.to_s)
    @products = @user.products.all(:include => :offers)

INSERT INTO `products` (`manufacturer_id`, `created_at`, `title`, `image_url`, `updated_at`, `version`, `category_id`, `description`, `product_code`) VALUES(NULL, '2010-07-21 17:57:27', 'bala', NULL, '2010-07-21 17:57:27', NULL, NULL, '&lt;p&gt;sdfsdfsdf&lt;/p&gt;', NULL)
---
  def create
    @product = Product.new(params[:product])
    #@product.user_id = current_user.id
    process_file_uploads(@product)

    respond_to do |format|
      if @product.save

SELECT * FROM `products` WHERE (`products`.`id` = 980190966)
UPDATE `products` SET `updated_at` = '2010-07-21 08:37:30', `description` = '&lt;p&gt;Jessica Livingston has&lt;/p&gt;' WHERE `id` = 1
---
  def update
    @product = Product.find(params[:id])
    process_file_uploads(@product)

    respond_to do |format|
      if @product.update_attributes(params[:product])