app/controllers/cart_controller.rb

  def add
    logger.info("[CART][ADD] which product is being added ? " + params[:id])

    begin
      product = Product.find(params[:id])
      offer = product.offers.first
---
SELECT * FROM `products` WHERE (`products`.`id` = 1)
SELECT `offers`.* FROM `offers` INNER JOIN `user_product_offers` ON `offers`.id = `user_product_offers`.offer_id WHERE ((`user_product_offers`.product_id = 1)) LIMIT 1