app/controllers/home_controller.rb

  def add_to_cart
    begin
      product = Product.find(params[:id])
---
SELECT * FROM `products` WHERE (`products`.`id` = 8)