app/controllers/offers_controller.rb

  def show
    @offer = Offer.find(params[:id])
---
SELECT * FROM `offers` WHERE (`offers`.`id` = 7)

  def create
    @offer = Offer.new(params[:offer])
    flash[:notice] = "Offer was successfully created."
    respond_to do |format|
      if @offer.save
---
INSERT INTO `offers` (`created_at`, `quantity`, `expired_at`, `updated_at`, `date_available`, `sku`, `is_disabled`, `list_price`, `offer_price`) VALUES('2010-07-26 17:02:07', 1, '2010-07-31 00:00:00', '2010-07-26 17:02:07', '2010-07-26 00:00:00', 'BALA-SKU', NULL, 10.0, 40.0)