app/controllers/products_controller.rb

SELECT * FROM `assets` WHERE (`assets`.attachable_id = 1 AND `assets`.attachable_type = 'Product')
SELECT `offers`.* FROM `offers` WHERE (`offers`.product_id IN (1,2,3,4,5,6,7,8))
---
  def index
  #  @products = Product.find(:all,:conditions=>['user_id = ?',current_user.id])
    @products = Product.find(:all,:include => [:offers,:assets])

SELECT * FROM `products` WHERE (`products`.`id` = 2)
---
  def show
    name = params[:id]
    logger.info("ROSE " + name)
    @product = Product.find(name.reverse)